---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ItemNumber
source: html/185eb359-24a6-9895-5754-bc972bd25067.htm
---
# Autodesk.Revit.DB.FabricationPart.ItemNumber Property

The item number that is used for identification, re-ordering from shop.

## Syntax (C#)
```csharp
public string ItemNumber { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: